tests/wrk/nginx_proxy.txt
****************************
*
*  Test Nginx proxy server
*
****************************

Purpose:
=======

Run performance tests with WRK against an Nginx proxy server.


Machines:
========

Driver machine: 

Ubuntu 18.04.5 LTS (GNU/Linux 4.15.0-112-generic x86_64)
Located in Santa Clara, California

Client VM:

Ubuntu 18.04.4 LTS (GNU/Linux 4.15.0-112-generic aarch64)
Located in Hong Kong

x86_64 VM:

Ubuntu 18.04.4 LTS (GNU/Linux 4.15.0-112-generic x86_64)
Located in Hong Kong

arm64 VM:

Ubuntu 18.04.5 LTS (GNU/Linux 4.15.0-112-generic aarch64)
Located in Hong Kong


System settings:
===============

    $ sysctl net.core.somaxconn
net.core.somaxconn = 1024

    $ sudo sysctl -w net.core.somaxconn=65535 
net.core.somaxconn = 65535

    $ sysctl net.ipv4.tcp_max_syn_backlog
net.ipv4.tcp_max_syn_backlog = 1024

    $ sudo sysctl -w net.ipv4.tcp_max_syn_backlog=65535
net.ipv4.tcp_max_syn_backlog = 65535


Apache httpd backend server:
===========================

Configuration settings:

Listen 127.0.0.1:8081
ServerName 127.0.0.1:8081

# KeepAlive settings
Timeout 300
KeepAlive On
MaxKeepAliveRequests 500
KeepAliveTimeout 5

# Performance settings
ListenBacklog 10000
ThreadLimit 250
ThreadsPerChild 250
ServerLimit 30
MaxRequestWorkers 7500
MinSpareThreads 100
MaxSpareThreads 700

# CGI settings

LoadModule cgid_module modules/mod_cgid.so
ScriptAlias "/cgi-bin/" "[httpd install home]/cgi-bin/"

CGI script:

#!/usr/bin/perl
# second.pl
use strict;
use warnings;

print "Content-type: text/html\n\n";
foreach my $key (keys %ENV) {
    print "$key --> $ENV{$key}<br>";
}


Nginx proxy server:
===========================

Configuration settings:

listen       8080;
server_name  [Server internal IP];

location / {
    root   html;
    index  index.html index.htm;
}

location /cgi-bin {
    proxy_pass http://127.0.0.1:8081;
}


WRK usage:
=========

Basic test:

    $ wrk -t12 -c400 -d30s http://[target IP]:8080/cgi-bin/second.pl

This runs a benchmark for 30 seconds, using 12 threads,
and keeping 400 HTTP connections open.

Focused test:

    $ wrk -t8 -c96 -d30s http://[target IP]:8080/cgi-bin/second.pl

This runs a benchmark for 30 seconds, using 8 threads,
and keeping 96 HTTP connections open.


Run WRK tests from driver machine:
=================================

Basic test, first round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   253.11ms  234.74ms   1.98s    85.79%
    Req/Sec    63.26     28.05   313.00     74.75%
  22640 requests in 30.03s, 24.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 259
Requests/sec:    753.86
Transfer/sec:    820.70KB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   260.00ms  247.14ms   1.99s    85.06%
    Req/Sec    63.10     24.31   320.00     76.26%
  22619 requests in 30.10s, 24.07MB read
  Socket errors: connect 0, read 0, write 0, timeout 294
Requests/sec:    751.46
Transfer/sec:    818.81KB

Basic test, second round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   253.85ms  234.54ms   1.98s    85.61%
    Req/Sec    63.02     25.17   272.00     70.69%
  22594 requests in 30.04s, 24.02MB read
  Socket errors: connect 0, read 0, write 0, timeout 234
Requests/sec:    752.22
Transfer/sec:    818.77KB

Running 30s test @ http://[arm64 VM IP]:8080/cgi/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   271.31ms  257.83ms   2.00s    83.17%
    Req/Sec    63.40     23.28   240.00     65.94%
  22692 requests in 30.10s, 24.14MB read
  Socket errors: connect 0, read 0, write 0, timeout 260
Requests/sec:    753.87
Transfer/sec:    821.35KB

Focused test, first round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   184.61ms  100.67ms   1.19s    97.35%
    Req/Sec    69.52     23.48   121.00     71.42%
  16308 requests in 30.03s, 17.34MB read
Requests/sec:    543.00
Transfer/sec:    591.23KB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   167.70ms    5.08ms 240.54ms   78.35%
    Req/Sec    71.12     21.55   121.00     76.27%
  16957 requests in 30.03s, 18.05MB read
Requests/sec:    564.62
Transfer/sec:    615.33KB

Focused test, second round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   169.58ms    4.02ms 217.51ms   80.86%
    Req/Sec    70.32     23.48   121.00     69.62%
  16762 requests in 30.03s, 17.82MB read
Requests/sec:    558.10
Transfer/sec:    607.68KB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   167.72ms    4.66ms 220.99ms   77.22%
    Req/Sec    71.10     19.13   121.00     70.85%
  16955 requests in 30.04s, 18.04MB read
Requests/sec:    564.38
Transfer/sec:    615.07KB


Run WRK tests from client VM with external IPs:
==============================================

Basic test, first round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   165.30ms   24.99ms 506.96ms   89.08%
    Req/Sec   200.13     32.55   350.00     75.45%
  71864 requests in 30.10s, 75.15MB read
Requests/sec:   2387.57
Transfer/sec:      2.50MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   249.51ms  100.56ms   1.62s    90.58%
    Req/Sec   136.37     34.82   330.00     73.42%
  48821 requests in 30.04s, 51.13MB read
Requests/sec:   1624.96
Transfer/sec:      1.70MB

Basic test, second round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   164.45ms   24.83ms 566.60ms   89.64%
    Req/Sec   201.09     32.19   343.00     74.85%
  72132 requests in 30.10s, 75.43MB read
Requests/sec:   2396.68
Transfer/sec:      2.51MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   236.38ms   87.80ms   1.92s    89.46%
    Req/Sec   135.19     43.24   830.00     73.99%
  46432 requests in 30.10s, 48.61MB read
  Socket errors: connect 0, read 0, write 0, timeout 171
Requests/sec:   1542.70
Transfer/sec:      1.62MB

Focused test, first round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.50ms   32.23ms 650.72ms   92.35%
    Req/Sec   289.29     30.24   480.00     73.50%
  69175 requests in 30.02s, 73.55MB read
Requests/sec:   2304.38
Transfer/sec:      2.45MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.67ms  139.19ms   1.36s    87.72%
    Req/Sec   204.07     52.76   414.00     66.38%
  48810 requests in 30.02s, 51.90MB read
Requests/sec:   1625.84
Transfer/sec:      1.73MB

Focused test, second round:

Requests/sec:   1649.93
Transfer/sec:      1.71MB
Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.85ms   30.08ms 498.40ms   92.23%
    Req/Sec   290.21     29.19   424.00     70.38%
  69390 requests in 30.02s, 73.78MB read
Requests/sec:   2311.13
Transfer/sec:      2.46MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev

    Latency   115.75ms  165.34ms   1.86s    87.24%
    Req/Sec   203.05     56.21   434.00     69.06%
  48242 requests in 30.02s, 51.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:   1607.01
Transfer/sec:      1.71MB


Run WRK tests from client VM with internal IPs:
==============================================

Basic test, first round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   167.71ms   29.03ms 471.54ms   86.55%
    Req/Sec   197.26     32.35   333.00     67.43%
  70698 requests in 30.04s, 73.95MB read
Requests/sec:   2353.57
Transfer/sec:      2.46MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   252.98ms  148.02ms   2.00s    91.63%
    Req/Sec   138.13     31.28   330.00     67.84%
  49506 requests in 30.04s, 51.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:   1647.75
Transfer/sec:      1.73MB

Basic test, second round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   166.52ms   25.83ms 527.58ms   88.85%
    Req/Sec   198.69     31.90   330.00     72.66%
  71286 requests in 30.10s, 74.55MB read
Requests/sec:   2368.32
Transfer/sec:      2.48MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   237.60ms   31.36ms 792.34ms   92.23%
    Req/Sec   139.04     32.34   340.00     74.97%
  49842 requests in 30.04s, 52.15MB read
Requests/sec:   1659.02
Transfer/sec:      1.74MB

Focused test, first round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.95ms   29.23ms 504.29ms   91.35%
    Req/Sec   288.93     30.21   434.00     72.83%
  69093 requests in 30.02s, 73.46MB read
Requests/sec:   2301.47
Transfer/sec:      2.45MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   108.23ms  150.38ms   1.40s    87.17%
    Req/Sec   204.44     53.25   440.00     66.75%
  48897 requests in 30.02s, 51.99MB read
Requests/sec:   1628.59
Transfer/sec:      1.73MB 

Focused test, second round:

Running 30s test @ http://[x86_64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.73ms   32.76ms 642.64ms   92.06%
    Req/Sec   288.30     30.04   420.00     75.21%
  68945 requests in 30.02s, 73.31MB read
Requests/sec:   2296.65
Transfer/sec:      2.44MB

Running 30s test @ http://[arm64 VM IP]:8080/cgi-bin/second.pl
  8 threads and 96 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   104.89ms  144.56ms   1.42s    87.36%
    Req/Sec   204.15     52.82   410.00     66.25%
  48823 requests in 30.02s, 51.92MB read
Requests/sec:   1626.46
Transfer/sec:      1.73MB


Summary:
=======

Run WRK tests from driver machine:

12 threads and 400 connections:
  x86_64:   Latency  253.11ms, 253.85ms   Requests/sec:  753.86, 752.22
  arm64:    Latency  260.00ms, 271.31ms   Requests/sec:  751.46, 753.87
8 threads and 96 connections:
  x86_64:   Latency  184.61ms, 169.58ms   Requests/sec:  543.00, 558.10
  arm64:    Latency  167.70ms, 167.72ms   Requests/sec:  564.62, 564.38

Run WRK tests from client VM with external IPs:

12 threads and 400 connections:
  x86_64:   Latency  165.30ms, 164.45ms   Requests/sec:  2387.57, 2396.68
  arm64:    Latency  249.51ms, 236.38ms   Requests/sec:  1624.96, 1542.70
8 threads and 96 connections:
  x86_64:   Latency   45.50ms,  44.85ms   Requests/sec:  2304.38, 2311.13
  arm64:    Latency  101.67ms, 115.75ms   Requests/sec:  1625.84, 1607.01

Run WRK tests from client VM with internal IPs:

12 threads and 400 connections:
  x86_64:   Latency  167.71ms, 166.52ms   Requests/sec:  2353.57, 2368.32
  arm64:    Latency  252.98ms, 237.60ms   Requests/sec:  1647.75, 1659.02
8 threads and 96 connections:
  x86_64:   Latency   44.95ms,  45.73ms   Requests/sec:  2301.47, 2296.65
  arm64:    Latency  108.23ms, 104.89ms   Requests/sec:  1628.59, 1626.46

Conclusion:
==========

So as expected, the latency from Santa Clara to Hong Kong is much higher 
and the throughput is much lower than tests run locally in Hong Kong.
From Santa Clara, the latency is slightly lower for arm64 versus x86_64
and the throughput difference isn't significant.

IThe latency and throughput differences between running from external IPs and
internal IPs locally in Hong Kong isn't significant.
In both of these cases, the latency is significantly higher and the throughput
is significantly lower for arm64 versus x86_64.